{
  "jokes": {
    "science": [
      {
        "key": 1,
        "joke": "Why don't scientists trust atoms? Because they make up everything!",
        "type": "science"
      },
      {
        "key": 5,
        "joke": "Did you hear about the mathematician who's afraid of negative numbers? He'll stop at nothing to avoid them.",
        "type": "science"
      },
      {
        "key": 12,
        "joke": "Why was the math book sad? Because it had too many problems.",
        "type": "science"
      },
      {
        "key": 17,
        "joke": "Why do biologists write very neatly? They have good cell structure.",
        "type": "science"
      },
      {
        "key": 20,
        "joke": "How does a scientist freshen their breath? With experi-mints!",
        "type": "science"
      },
      {
        "key": 28,
        "joke": "Why do chemists like nitrates so much? Because they're cheaper than day rates!",
        "type": "science"
      }
    ],
    "puns": [
      {
        "key": 2,
        "joke": "Parallel lines have so much in common. It’s a shame they’ll never meet.",
        "type": "puns"
      },
      {
        "key": 4,
        "joke": "I told my wife she was drawing her eyebrows too high. She seemed surprised.",
        "type": "puns"
      },
      {
        "key": 6,
        "joke": "I'm reading a book on anti-gravity. It's impossible to put down!",
        "type": "puns"
      },
      {
        "key": 11,
        "joke": "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "type": "puns"
      },
      {
        "key": 13,
        "joke": "Why did the bicycle fall over? Because it was two-tired!",
        "type": "puns"
      },
      {
        "key": 14,
        "joke": "Why did the chicken go to the seance? To talk to the other side.",
        "type": "puns"
      },
      {
        "key": 18,
        "joke": "Why did the golfer bring two pairs of pants? In case he got a hole in one!",
        "type": "puns"
      },
      {
        "key": 21,
        "joke": "Why don't oysters donate to charity? Because they are shellfish.",
        "type": "puns"
      },
      {
        "key": 24,
        "joke": "How do you organize a space party? You planet!",
        "type": "puns"
      },
      {
        "key": 26,
        "joke": "Why was the cell phone wearing glasses? It lost its contacts.",
        "type": "puns"
      },
      {
        "key": 29,
        "joke": "What did one wall say to the other wall? I'll meet you at the corner!",
        "type": "puns"
      }
    ],
    "programming": [
      {
        "key": 3,
        "joke": "Why did the programmer go broke? Because he used up all his cache.",
        "type": "programming"
      },
      {
        "key": 7,
        "joke": "Why don't programmers like nature? It has too many bugs.",
        "type": "programming"
      },
      {
        "key": 10,
        "joke": "Why did the web developer walk out of therapy? The therapist told him he had too many issues.",
        "type": "programming"
      },
      {
        "key": 15,
        "joke": "Why don't programmers like to go outside? The sunlight causes too many glare errors.",
        "type": "programming"
      },
      {
        "key": 19,
        "joke": "Why did the programmer quit his job? He didn't get arrays.",
        "type": "programming"
      },
      {
        "key": 22,
        "joke": "Why did the computer go to therapy? It had too many bytes of emotional baggage.",
        "type": "programming"
      },
      {
        "key": 25,
        "joke": "Why don't programmers like to go outside? The light attracts bugs.",
        "type": "programming"
      },
      {
        "key": 30,
        "joke": "Why do programmers always mix up Christmas and Halloween? Because Oct 31 == Dec 25.",
        "type": "programming"
      }
    ]
  }
}